Личный_помощник/src/Documents/ФиксацияПоказателейКоммунальныхУслуг/ФиксацияПоказателейКоммунальныхУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ФиксацияПоказателейКоммунальныхУслуг</name>
  <registerRecords>InformationRegister.ПоказанияСчетчиков</registerRecords>
  <registerRecords>AccumulationRegister.ФиксацияПоказателейКоммунальныхУслуг</registerRecords>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>МесяцОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.ВидыУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущееПоказаниеСчетчика</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПотребляемоеЗначение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипУчета</name>
      <type>
        <types>EnumRef.ТипУчетаУслуги</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Личный_помощник/src/InformationRegisters/ПоказанияСчетчиков/ПоказанияСчетчиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПоказанияСчетчиков</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидУслуги</name>
    <type>
      <types>CatalogRef.ВидыУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Личный_помощник/src/InformationRegisters/ФиксированныеСуммыОплатыКоммунальныхУслуг/ФиксированныеСуммыОплатыКоммунальныхУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФиксированныеСуммыОплатыКоммунальныхУслуг</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидУслуги</name>
    <type>
      <types>CatalogRef.ВидыУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Личный_помощник/src/InformationRegisters/ЗначенияТарифов/ЗначенияТарифов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияТарифов</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидУслуги</name>
    <type>
      <types>CatalogRef.ВидыУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Личный_помощник/src/Enums/ТипУчетаУслуги/ТипУчетаУслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипУчетаУслуги</name>
  <enumValues>
    <name>ПоПоказаниям</name>
  </enumValues>
  <enumValues>
    <name>Суммой</name>
  </enumValues>
  <enumValues>
    <name>ПоПотреблению</name>
  </enumValues>
  <enumValues>
    <name>Произвольный</name>
  </enumValues>
</mdclass:Enum>

Личный_помощник/src/Catalogs/ШаблоныОпераций/ШаблоныОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныОпераций</name>
  <tabularSections>
    <name>Операции</name>
    <attributes>
      <name>ТипУчета</name>
      <type>
        <types>EnumRef.ТипУчетаУслуги</types>
      </type>
    </attributes>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.ВидыУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Личный_помощник/src/Catalogs/ВидыУслуг/ВидыУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыУслуг</name>
  <predefined>
    <items>
      <name>Водоотведение</name>
      <description>Водоотведение</description>
    </items>
    <items>
      <name>Газ</name>
      <description>Газ</description>
    </items>
    <items>
      <name>ГорячаяВода</name>
      <description>Горячая вода</description>
    </items>
    <items>
      <name>Домофон</name>
      <description>Домофон</description>
    </items>
    <items>
      <name>Интернет</name>
      <description>Интернет</description>
    </items>
    <items>
      <name>КапитальныйРемонт</name>
      <description>Капитальный ремонт</description>
    </items>
    <items>
      <name>Отопление</name>
      <description>Отопление</description>
    </items>
    <items>
      <name>СодержаниеЖилья</name>
      <description>Содержание жилья</description>
    </items>
    <items>
      <name>ХолоднаяВода</name>
      <description>Холодная вода</description>
    </items>
    <items>
      <name>Электроэнергия</name>
      <description>Электроэнергия</description>
    </items>
  </predefined>
  <attributes>
    <name>ПоСчетчику</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксированнаяСумма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольнаяСумма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
</mdclass:Catalog>

Личный_помощник/src/Documents/ФиксацияПоказателейКоммунальныхУслуг/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.МесяцОплаты = ТекущаяДата();
	ЗаполнитьКэш();	
	ИзменитьДоступностьКомандыЗаполненияпоШаблону();	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ШаблонПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Шаблон) Тогда
		ЗаполнитьСписокУслугПоШаблону();	
	КонецЕсли;
	
	ИзменитьДоступностьКомандыЗаполненияпоШаблону();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоШаблону(Команда)
	ЗаполнитьСписокУслугПоШаблону();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФиксированныеСуммыИПоказания(Команда)
	РассчитатьПоказателиИСуммы();
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	ФиксацияУслуги = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущиеДанные.Услуга, "ПроизвольнаяСумма, ПоСчетчику, ФиксированнаяСумма");
	Если ФиксацияУслуги.ПроизвольнаяСумма Тогда
		ФиксированнаяСумма = ФиксированныеСуммыОплаты.НайтиСтроки(Новый Структура("ВидУслуги", ТекущиеДанные.Услуга));
		ТекущиеДанные.Сумма = ?(ФиксированнаяСумма.Количество() > 0, ФиксированнаяСумма[0].Сумма, 0);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ТипУчета) Тогда
		ТекущиеДанные.ТипУчета = ПредопределенноеЗначение("Перечисление.ТипУчетаУслуги.ПоПоказаниям");
	КонецЕсли;
	
	УстановитьДоступностьКолонок(ТекущиеДанные.ТипУчета);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиТекущееПоказаниеСчетчикаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	Если ТекущиеДанные.ТипУчета = ПредопределенноеЗначение("Перечисление.ТипУчетаУслуги.ПоПоказаниям") Тогда
		ПоказаниеСчетчикаПоУслуге = ПоказанияСчетчиков.НайтиСтроки(Новый Структура("ВидУслуги", ТекущиеДанные.Услуга));
		ПредыдущееПоказаниеСчетчика = ?(ПоказаниеСчетчикаПоУслуге.Количество() > 0, ПоказаниеСчетчикаПоУслуге[0].Значение, 0);
		ТекущиеДанные.ПотребляемоеЗначение = ТекущиеДанные.ТекущееПоказаниеСчетчика - ПредыдущееПоказаниеСчетчика;
		ЗначениеТарифа = ЗначенияТарифов.НайтиСтроки(Новый Структура("ВидУслуги", ТекущиеДанные.Услуга));
		ТекущиеДанные.Сумма = ?(ЗначениеТарифа.Количество() > 0, ЗначениеТарифа[0].Значение, 0) * ТекущиеДанные.ПотребляемоеЗначение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСуммаПриИзменении(Элемент)
	

КонецПроцедуры

&НаКлиенте
Процедура УслугиТипУчетаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ТипУчета) Тогда
		ТекущиеДанные.ТипУчета = ПредопределенноеЗначение("Перечисление.ТипУчетаУслуги.ПоПоказаниям");
	КонецЕсли;
	
	УстановитьДоступностьКолонок(ТекущиеДанные.ТипУчета);
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьДоступностьКолонок(ТипУчета)
	
	Если ТипУчета = ПредопределенноеЗначение("Перечисление.ТипУчетаУслуги.Суммой") Тогда
		Элементы.Услуги.ПодчиненныеЭлементы.УслугиТекущееПоказаниеСчетчика.ТолькоПросмотр = Истина;
		Элементы.Услуги.ПодчиненныеЭлементы.УслугиПотребляемоеЗначение.ТолькоПросмотр = Истина;
		Элементы.Услуги.ПодчиненныеЭлементы.УслугиСумма.ТолькоПросмотр = Ложь;
	ИначеЕсли ТипУчета = ПредопределенноеЗначение("Перечисление.ТипУчетаУслуги.ПоПоказаниям") Тогда
		Элементы.Услуги.ПодчиненныеЭлементы.УслугиТекущееПоказаниеСчетчика.ТолькоПросмотр = Ложь;
		Элементы.Услуги.ПодчиненныеЭлементы.УслугиПотребляемоеЗначение.ТолькоПросмотр = Истина;
		Элементы.Услуги.ПодчиненныеЭлементы.УслугиСумма.ТолькоПросмотр = Истина;
	ИначеЕсли ТипУчета = ПредопределенноеЗначение("Перечисление.ТипУчетаУслуги.ПоПотреблению") Тогда
		Элементы.Услуги.ПодчиненныеЭлементы.УслугиТекущееПоказаниеСчетчика.ТолькоПросмотр = Истина;
		Элементы.Услуги.ПодчиненныеЭлементы.УслугиПотребляемоеЗначение.ТолькоПросмотр = Ложь;
		Элементы.Услуги.ПодчиненныеЭлементы.УслугиСумма.ТолькоПросмотр = Истина;
	Иначе
		Элементы.Услуги.ПодчиненныеЭлементы.УслугиТекущееПоказаниеСчетчика.ТолькоПросмотр = Ложь;
		Элементы.Услуги.ПодчиненныеЭлементы.УслугиПотребляемоеЗначение.ТолькоПросмотр = Ложь;
		Элементы.Услуги.ПодчиненныеЭлементы.УслугиСумма.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокУслугПоШаблону()
	
	Объект.Услуги.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШаблоныОперацийОперации.Услуга,
		|	ШаблоныОперацийОперации.ТипУчета
		|ИЗ
		|	Справочник.ШаблоныОпераций.Операции КАК ШаблоныОперацийОперации
		|ГДЕ
		|	ШаблоныОперацийОперации.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Шаблон);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Услуги.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	РассчитатьПоказателиИСуммы();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьДоступностьКомандыЗаполненияпоШаблону()	
	КомандаЗаполненияПоШаблонуДоступна = ЗначениеЗаполнено(Объект.Шаблон);
	ЭлементУслугиЗаполнить = Элементы.Группа1.ПодчиненныеЭлементы.УслугиЗаполнить;
	ЭлементУслугиЗаполнитьПоШаблону = ЭлементУслугиЗаполнить.ПодчиненныеЭлементы.УслугиЗаполнитьПоШаблону;
	ЭлементУслугиЗаполнитьПоШаблону.Видимость = КомандаЗаполненияПоШаблонуДоступна;
КонецПроцедуры

&НаСервере
Процедура РассчитатьПоказателиИСуммы()
	
	Услуги = РеквизитФормыВЗначение("Объект").Услуги.ВыгрузитьКолонку("Услуга");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыУслуг.Ссылка КАК Услуга,
		|	ЕСТЬNULL(ПоказанияСчетчиков.Значение, 0) КАК ТекущееПоказаниеСчетчика,
		|	ЕСТЬNULL(ФиксированныеСуммыОплатыКоммунальныхУслугСрезПоследних.Сумма, 0) КАК Сумма,
		|	0 КАК ПотребляемоеЗначение
		|ИЗ
		|	Справочник.ВидыУслуг КАК ВидыУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияСчетчиков.СрезПоследних(&Дата, ВидУслуги В (&Услуги)) КАК ПоказанияСчетчиков
		|		ПО ВидыУслуг.Ссылка = ПоказанияСчетчиков.ВидУслуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФиксированныеСуммыОплатыКоммунальныхУслуг.СрезПоследних(&Дата, ВидУслуги В (&Услуги)) КАК ФиксированныеСуммыОплатыКоммунальныхУслугСрезПоследних
		|		ПО ВидыУслуг.Ссылка = ФиксированныеСуммыОплатыКоммунальныхУслугСрезПоследних.ВидУслуги
		|ГДЕ
		|	ВидыУслуг.Ссылка В(&Услуги)";
	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("Услуги", Услуги);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НайденныеСтроки = Объект.Услуги.НайтиСтроки(Новый Структура("Услуга", Выборка.Услуга));
		Для Каждого Строка Из НайденныеСтроки Цикл
			ЗаполнитьЗначенияСвойств(Строка, Выборка);	
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКэш()
	
	Значения = РегистрыСведений.ЗначенияТарифов.ПолучитьЗначенияТарифов(, Объект.Дата);
	ЗначениеВДанныеФормы(Значения, ЗначенияТарифов);	
	
	Значения = РегистрыСведений.ФиксированныеСуммыОплатыКоммунальныхУслуг.ПолучитьСуммыОплаты(, Объект.Дата);
	ЗначениеВДанныеФормы(Значения, ФиксированныеСуммыОплаты);
	
	Значения = РегистрыСведений.ПоказанияСчетчиков.ПолучитьПоказанияСчетчиков(, Объект.Дата);
	ЗначениеВДанныеФормы(Значения, ПоказанияСчетчиков);
	
КонецПроцедуры

#КонецОбласти
